Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  for(;;){

    // check if config update is available
    if (xQueueReceive(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY) == pdPASS) {
      global_dap_config_class.setConfig(configPackage_st.config_st);

      Serial.println("Config update received: config handling task");

      // send queues to other tasks

      // Send the package to the queue. Use a timeout of 0 (non-blocking).
      // If the queue is full, the data is simply dropped. This prevents this
      // high-priority control task from ever blocking on a full serial buffer.
      xQueueSend(configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, portMAX_DELAY);
      xQueueSend(configUpdateSendToLoadcellTaskQueue, &configPackage_st, portMAX_DELAY);
      // xQueueSend(configUpdateSendToJoystickTaskQueue, &configPackage_st, portMAX_DELAY);
      xQueueSend(configUpdateSendToSerialRXTaskQueue, &configPackage_st, portMAX_DELAY);

    }
  }
}



/**********************************************************************************************/
/*                                                                                            */
/*                         loadcell reading                                                   */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG loadcellReadingTask( void * pvParameters )
{

  static FunctionProfiler profiler_loadcellReading;
  profiler_loadcellReading.setName("loadcellReading");
  profiler_loadcellReading.setNumberOfCalls(3000);

  static float loadcellReading_fl32 = 0.0f;
  static DAP_config_st loadcellTask_dap_config_st;
  configDataPackage_t configPackage_st;

  static float previousLoadcellReadingInKg_fl32 = 0.0f;

  for(;;){

    if (loadcell != NULL)
    {

      // if new data package is available, update the local config
      if (xQueueReceive(configUpdateSendToLoadcellTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
        loadcellTask_dap_config_st = configPackage_st.config_st;

        // activate profiler depending on pedal config
        if (loadcellTask_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_loadcellReading.activate( true );
        }
        else
        {
          profiler_loadcellReading.activate( false );
        }

        Serial.println("Update config: loadcell task");
      }     

      // start profiler 0, overall function
      profiler_loadcellReading.start(0);

      // no need for delay, since getReadingKg will block until DRDY edge down is detected
      loadcellReading_fl32 = loadcell->getReadingKg();

      // Invert the loadcell reading digitally if desired
      if (loadcellTask_dap_config_st.payLoadPedalConfig_.invertLoadcellReading_u8 == 1)
      {
        loadcellReading_fl32 *= -1.0f;
      }

      // detect loadcell outlier
      float loadcellDifferenceToLastCycle_fl32 = loadcellReading_fl32 - previousLoadcellReadingInKg_fl32;
      previousLoadcellReadingInKg_fl32 = loadcellReading_fl32;

      if(!dap_calculationVariables_st.Rudder_status && !dap_calculationVariables_st.helicopterRudderStatus)
      {
        //make the force reading skip only in pedal mode
        // reject update when loadcell reading likely outlier
        if (fabsf(loadcellDifferenceToLastCycle_fl32) < 5.0f)
        {
          
          // send joystick data to queue
          if (loadcellDataQueue != NULL) {

              // Package the new state data into a single struct
              loadcellDataPackage_t newLoadcellPackage;
              newLoadcellPackage.loadcellReadingInKg_fl32 = loadcellReading_fl32;

              // Send the package to the queue. Use a timeout of 0 (non-blocking).
              // If the queue is full, the data is simply dropped. This prevents this
              // high-priority control task from ever blocking on a full serial buffer.
              xQueueSend(loadcellDataQueue, &newLoadcellPackage, (TickType_t)0);
          }
        }
      }

      
      
      


      profiler_loadcellReading.end(0);

      // print profiler results
      // profiler_loadcellReading.report();


    }

    // force a context switch
		taskYIELD();
  }
}



// === Scheduler config ===
#define BASE_TICK_US 300   // base tick in microseconds
#define MAX_TASKS    10     // maximum tasks in scheduler


// Task entry struct
typedef struct {
  TaskHandle_t handle;
  const char *name;
  TaskFunction_t fn;
  uint16_t intervalTicks;
  uint16_t counter;
  uint32_t lastKick;   // last time task ran (micros)
  UBaseType_t priority;
  BaseType_t core;
} SchedTask;

// Task table
SchedTask tasks[MAX_TASKS];
uint8_t taskCount = 0;

// Timer handle
hw_timer_t *timer0 = NULL;

// === Scheduler ISR ===
void IRAM_ATTR_FLAG onTimer(void* arg) {
  BaseType_t xHigherPriorityWoken = pdFALSE;

  for (int i = 0; i < taskCount; i++) {
    tasks[i].counter++;
    if (tasks[i].counter >= tasks[i].intervalTicks) {
      tasks[i].counter = 0;
      if(NULL != tasks[i].handle)
      {
        vTaskNotifyGiveFromISR(tasks[i].handle, &xHigherPriorityWoken);
      }
      
    }
  }

  // Yield if a higher-priority task was woken.
  if (xHigherPriorityWoken) 
  {
    portYIELD_FROM_ISR();
  }
}

// === Scheduler API ===
void addScheduledTask(TaskFunction_t fn, const char *name, uint16_t intervalUs,
                      UBaseType_t priority, BaseType_t core, uint32_t stackSize = 2048u) {
  if (taskCount >= MAX_TASKS) return;  // limit reached

  uint16_t intervalTicks = intervalUs / BASE_TICK_US;
  if (intervalTicks == 0) intervalTicks = 1;  // minimum 1 tick

  // Create task
  xTaskCreatePinnedToCore(fn, name, stackSize, NULL, priority,
                          &tasks[taskCount].handle, core);

  tasks[taskCount].intervalTicks = intervalTicks;
  tasks[taskCount].counter = 0;
  tasks[taskCount].name = name;
  taskCount++;
}




TaskHandle_t handle_pedalUpdateTask = NULL;
TaskHandle_t handle_joystickOutput = NULL;
TaskHandle_t handle_loadcellReadingTask = NULL;
TaskHandle_t handle_profilerTask = NULL;
TaskHandle_t handle_serialCommunicationRx = NULL; 
TaskHandle_t handle_serialCommunicationTx = NULL; 
TaskHandle_t handle_miscTask = NULL; 
TaskHandle_t handle_otaTask = NULL;
TaskHandle_t handle_espnowTask = NULL;
TaskHandle_t handle_configHandlingTask = NULL;

#define COUNTER_SIZE 4u
uint16_t tickCount_au16[COUNTER_SIZE] = {0};


static uint16_t timerTicks_espNowTask_u16 = REPETITION_INTERVAL_ESPNOW_TASK_IN_US / BASE_TICK_US;




/**********************************************************************************************/
/*                                                                                            */
/*                         setup function                                                     */
/*                                                                                            */
/**********************************************************************************************/
 // #define SERIAL_PATTERN_DETECTOR
#ifdef SERIAL_PATTERN_DETECTOR

#include "driver/uart.h"

// Structure to hold a complete UART packet
#define UART_RX_BUF_SIZE sizeof(DAP_config_st)
typedef struct {
    uint8_t data[UART_RX_BUF_SIZE];
    size_t len;
} UartPacket_t;

// Queue to pass packets from the UART event task to the processing task
static QueueHandle_t serial_packet_queue;

// Queue to handle UART events
static QueueHandle_t uart_queue;

// --- ADD THIS LINE ---
#define TEMP_BUFFER_SIZE (UART_RX_BUF_SIZE * 2)

/**
 * @brief Task to handle UART events with persistent buffering.
 *
 * This task accumulates data in a static buffer. After new data arrives,
 * it scans the buffer for one or more complete packets ending in the
 * {EOF_BYTE_0, EOF_BYTE_1} sequence. Valid packets are extracted, queued
 * for processing, and removed from the buffer.
 */
static void uart_event_task(void *pvParameters) {
    uart_event_t event;
    
