Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
    // Persistent buffer to accumulate fragmented data
    static uint8_t temp_buffer[TEMP_BUFFER_SIZE];
    static size_t temp_buffer_len = 0;

    for (;;) {
        // Wait for a UART event
        if (xQueueReceive(uart_queue, (void *)&event, (TickType_t)portMAX_DELAY)) {
            
            Serial.println("UART event triggered");

            switch (event.type) {
                case UART_PATTERN_DET: {

                    Serial.println("EOF1 detected");

                    // // Read all available new data from the hardware buffer
                    // uint8_t incoming_data[UART_RX_BUF_SIZE];
                    // size_t buffered_size;
                    // uart_get_buffered_data_len(UART_NUM_0, &buffered_size);
                    // int read_len = uart_read_bytes(UART_NUM_0, incoming_data, buffered_size, pdMS_TO_TICKS(100));

                    // if (read_len > 0) {
                    //     // --- 1. Append new data, checking for overflow ---
                    //     if (temp_buffer_len + read_len > TEMP_BUFFER_SIZE) {
                    //         Serial.println("ERROR: UART temporary buffer overflow. Discarding all data.");
                    //         temp_buffer_len = 0; // Reset the buffer
                    //         break; 
                    //     }
                    //     memcpy(&temp_buffer[temp_buffer_len], incoming_data, read_len);
                    //     temp_buffer_len += read_len;

                    //     // --- 2. Scan buffer for complete packets and process them ---
                    //     if (temp_buffer[temp_buffer_len-2] == EOF_BYTE_0 && temp_buffer[temp_buffer_len-1] == EOF_BYTE_1) {
                            

                    //         // --- 3. Extract the packet and send it to the queue ---
                    //         UartPacket_t packet_to_send;
                    //         packet_to_send.len = temp_buffer_len;
                    //         memcpy(packet_to_send.data, temp_buffer, temp_buffer_len);
                    //         xQueueSend(serial_packet_queue, &packet_to_send, (TickType_t)0);

                    //         // --- 4. Remove the processed packet by shifting the buffer ---
                    //         size_t remaining_len = 0;//temp_buffer_len - packet_len;
                    //         temp_buffer_len = remaining_len;
                    //     }
                    //   }
                    }
                    break;
                

                // --- Error handling cases remain the same ---
                case UART_FIFO_OVF:
                    Serial.println("Hardware FIFO overflow");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;

                case UART_BUFFER_FULL:
                    Serial.println("Ring buffer full");
                    uart_flush_input(UART_NUM_0);
                    xQueueReset(uart_queue);
                    temp_buffer_len = 0; // Also clear our temp buffer
                    break;
                
                default:
                    uart_flush_input(UART_NUM_0);
                    break;
            }
        }
    }
    vTaskDelete(NULL);
}

#endif




void setup()
{
  DAP_config_st dap_config_st_local;

  // ADD THIS: Create the queue before creating the tasks that use it.
  // The queue can hold up to N state packages.
  pedalStateQueue = xQueueCreate(10, sizeof(PedalStatePackage_t));
  if (pedalStateQueue == NULL) {
      Serial.println("Error creating the pedal state queue!");
  }
  joystickDataQueue = xQueueCreate(1, sizeof(joystickDataPackage_t));
  if (joystickDataQueue == NULL) {
      Serial.println("Error creating the joystick data queue!");
  }
  loadcellDataQueue = xQueueCreate(1, sizeof(loadcellDataPackage_t));
  if (loadcellDataQueue == NULL) {
      Serial.println("Error creating the joystick data queue!");
  }
  configUpdateAvailableQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateAvailableQueue == NULL) {
      Serial.println("Error creating the config data queue!");
  }
  configUpdateSendToPedalUpdateTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateSendToPedalUpdateTaskQueue == NULL) {
      Serial.println("Error creating the config data queue!");
  }
  configUpdateSendToLoadcellTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateSendToLoadcellTaskQueue == NULL) {
      Serial.println("Error creating the config data queue!");
  }
  // configUpdateSendToJoystickTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  // if (configUpdateSendToJoystickTaskQueue == NULL) {
  //     Serial.println("Error creating the config data queue!");
  // }
  configUpdateSendToSerialRXTaskQueue= xQueueCreate(1, sizeof(configDataPackage_t));
  if (configUpdateSendToSerialRXTaskQueue == NULL) {
      Serial.println("Error creating the config data queue!");
  }



  xTaskCreatePinnedToCore(
                    configHandlingTask,   /* Task function. */
                    "configHandlingTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_CONFIG_HANDLING_TASK,           /* priority of the task */
                    &handle_configHandlingTask,      /* Task handle to keep track of created task */
                    CORE_ID_CONFIG_HANDLING_TASK);          /* pin task to core 1 */  

  

  

  // setup brake resistor pin
  #ifdef BRAKE_RESISTOR_PIN
    pinMode(BRAKE_RESISTOR_PIN, OUTPUT);  // Set GPIO13 as an output
    digitalWrite(BRAKE_RESISTOR_PIN, LOW);  // Turn the LED on
  #endif

  #ifdef EMERGENCY_PIN
    pinMode(EMERGENCY_PIN,INPUT_PULLUP);
  #endif

  #ifdef ANGLE_SENSOR_GPIO

    pinMode(ANGLE_SENSOR_GPIO, INPUT);
    pinMode(ANGLE_SENSOR_GPIO_2, INPUT);
  #endif
  

  #ifdef USING_LED
    pixels.begin();
    pixels.setBrightness(20);
    pixels.setPixelColor(0,0xff,0xff,0xff);
    pixels.show(); 
  #endif
  
  #ifdef USING_BUZZER
    Buzzer.initialized(BuzzerPin,1);
    Buzzer.single_beep_tone(770,100);
  #endif

  #if PCB_VERSION == 7
    Serial.setTxTimeoutMs(0);
    Serial.begin(DEFAULTBAUD);
  #else
    #ifdef BAUDRATE3M
      Serial.begin(BAUD3M, SERIAL_8N1);
      Serial.setTxBufferSize(256);
    #else
      Serial.begin(DEFAULTBAUD, SERIAL_8N1);
    #endif
    Serial.setTimeout(5);
  #endif
  parse_version(DAP_FIRMWARE_VERSION, &versionMajor, &versionMinor, &versionPatch);
  Serial.println(" ");
  Serial.println(" ");
  Serial.println(" ");
  //delay(3000);
  Serial.println("This work is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 International License.");
  Serial.println("Please check github repo for more detail: https://github.com/ChrGri/DIY-Sim-Racing-FFB-Pedal");
  //printout the github releasing version
  //#ifdef OTA_update
  Serial.print("Board: ");
  Serial.println(CONTROL_BOARD);
  Serial.print("Firmware Version:");
  Serial.println(DAP_FIRMWARE_VERSION);
  //#endif
  #ifdef PRINT_PARTITION_TABLE
    printf("========== Partition Table ==========\n");
    printf("| %-10s | %-4s | %-7s | %-8s | %-8s | %-5s |\n", "Name", "Type", "SubType", "Offset", "Size", "Encrypted");
    printf("--------------------------------------------------------------------------------\n");
    esp_partition_iterator_t it = esp_partition_find(ESP_PARTITION_TYPE_ANY, ESP_PARTITION_SUBTYPE_ANY, NULL);
    while (it != NULL) {
        const esp_partition_t *part = esp_partition_get(it);
        printf("| %-10s | 0x%02x | 0x%02x    | 0x%08x | 0x%08x | %-5s |\n",
               part->label,      
               part->type,       
               part->subtype,    
               part->address,    
               part->size,       
               part->encrypted ? "true" : "false");
        it = esp_partition_next(it);
    }
    esp_partition_iterator_release(it);
    printf("=====================================\n");
  #endif
  
	#ifdef Hardware_Pairing_button
    pinMode(Pairing_GPIO, INPUT_PULLUP);
  #endif

