Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  // the joystickOutputTask does not need a dedicated timer, since it triggered by queue 
#ifdef USB_JOYSTICK
  xTaskCreatePinnedToCore(
      joystickOutputTask,      /* Task function. */
      "joystickOutputTask",    /* name of task. */
      4000,                           /* Stack size of task */
      NULL,                           /* parameter of the task */
      TASK_PRIORITY_JOYSTICKOUTPUT_TASK,                              /* priority of the task (e.g., 2, slightly higher than producer) */
      &handle_joystickOutput,  /* Task handle */
      CORE_ID_JOYSTICK_TASK); /* pin task to core */
#endif
  // the loadcell task does not need a dedicated timer, since it blocks by DRDY ready ISR
  xTaskCreatePinnedToCore(
                    loadcellReadingTask,   /* Task function. */
                    "loadcellReadingTask",     /* name of task. */
                    1500,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_LOADCELL_READING_TASK,           /* priority of the task */
                    &handle_loadcellReadingTask,      /* Task handle to keep track of created task */
                    CORE_ID_LOADCELLREADING_TASK);          /* pin task to core 1 */  

  // xTaskCreatePinnedToCore(
  //                   serialCommunicationTaskRx,   /* Task function. */
  //                   "serialCommunicationTaskRx",          /* name of task. */
  //                   5000,                      /* Stack size of task */
  //                   NULL,                      /* parameter of the task */
  //                   2,                         /* priority of the task */
  //                   &handle_serialCommunicationRx, /* Task handle to keep track of created task */
  //                   CORE_ID_SERIAL_COMMUNICATION_TASK); /* pin task to core */
	
  


xTaskCreatePinnedToCore(
                    profilerTask,   /* Task function. */
                    "profilerTask",     /* name of task. */
                    3000,       /* Stack size of task */
                    NULL,        /* parameter of the task */
                    TASK_PRIORITY_PROFILER_TASK,           /* priority of the task */
                    &handle_profilerTask,      /* Task handle to keep track of created task */
                    CORE_ID_PROFILER_TASK);          /* pin task to core 1 */

  xTaskCreatePinnedToCore(
                    miscTask,   
                    "miscTask", 
                    2000,  
                    NULL,      
                    TASK_PRIORITY_MISC_TASK,         
                    &handle_miscTask,    
                    CORE_ID_MISC_TASK);     


                    
 
  #ifdef SERIAL_PATTERN_DETECTOR

    // --- ADD: Create the serialCommunicationTask as a standalone task ---
  // Create the queue to hold incoming serial packets
  serial_packet_queue = xQueueCreate(10, sizeof(UartPacket_t)); // Queue can hold 10 packets


  // This prevents the "UART driver already installed" error.
  uart_driver_delete(UART_NUM_0);
  
  // --- MODIFIED: Install driver over the existing UART0 ---
  // Note: This will reconfigure the port used by the Arduino `Serial` object.
  esp_err_t err = uart_driver_install(UART_NUM_0, UART_RX_BUF_SIZE * 2, 0, 20, &uart_queue, 0);
  if (err != ESP_OK) {
    Serial.printf("Failed to install UART driver: %d\n", err);
    return;
  }

  // Configure UART parameters
  // SERIAL_8N1
  uart_config_t uart_config = {
      .baud_rate = BAUD3M,
      .data_bits = UART_DATA_8_BITS,
      .parity    = UART_PARITY_DISABLE,
      .stop_bits = UART_STOP_BITS_1,
      .flow_ctrl = UART_HW_FLOWCTRL_DISABLE,
      .source_clk = UART_SCLK_XTAL,
  };
  
  // Apply the UART configuration
  uart_param_config(UART_NUM_0, &uart_config);

  // --- NEW: Enable UART pattern detection ---
  #define SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US 100
  uart_enable_pattern_det_baud_intr(UART_NUM_0, EOF_BYTE_1, 1, SERIAL_PATTERN_DETECTION_TIMEOUT_IN_US, 0, 0);

  // Create the task that will handle UART events
  xTaskCreate(
      uart_event_task,    // Task function
      "uart_event_task",  // Name of the task
      4096,               // Stack size
      NULL,               // Task input parameter
      12,                 // Priority of the task
      NULL                // Task handle
  );

  #endif
  



  #if defined(OTA_update)  || defined(OTA_update_ESP32)
  
    switch(dap_config_st_local.payLoadPedalConfig_.pedal_type)
    {
      case 0:
        APhost=new char[strlen("FFBPedalClutch") + 1];
        strcpy(APhost, "FFBPedalClutch");
        //APhost="FFBPedalClutch";
        break;
      case 1:
        APhost=new char[strlen("FFBPedalBrake") + 1];
        strcpy(APhost, "FFBPedalBrake");
        //APhost="FFBPedalBrake";
        break;
      case 2:
        APhost=new char[strlen("FFBPedalGas") + 1];
        strcpy(APhost, "FFBPedalGas");
        //APhost="FFBPedalGas";
        break;
      default:
        APhost=new char[strlen("FFBPedal") + 1];
        strcpy(APhost, "FFBPedal");
        //APhost="FFBPedal";
        break;        

    }   
                   
    addScheduledTask(OTATask, "OTATask", REPETITION_INTERVAL_OTA_TASK_IN_US, TASK_PRIORITY_OTA_TASK, CORE_ID_OTA_TASK, 16000);

    delay(200);
  #endif

  //MCP setup
  #ifdef Using_analog_output_ESP32_S3
    //Wire.begin(MCP_SDA,MCP_SCL,400000);
    MCP4725_I2C.begin(MCP_SDA,MCP_SCL,400000);
    uint8_t i2c_address[8]={0x60,0x61,0x62,0x63,0x64,0x65,0x66,0x67};
    int index_address=0;
    int found_address=0;
    int error;
    for(index_address=0;index_address<8;index_address++)
    {
      MCP4725_I2C.beginTransmission(i2c_address[index_address]);
      error = MCP4725_I2C.endTransmission();
      if (error == 0)
      {
        Serial.print("I2C device found at address");
        Serial.print(i2c_address[index_address]);
        Serial.println("  !");
        found_address=index_address;
        break;
        
      }
      else
      {
        Serial.print("try address");
        Serial.println(i2c_address[index_address]);
      }
    }
    
    if(dac.begin(i2c_address[found_address], &MCP4725_I2C)==false)
    {
      Serial.println("Couldn't find MCP, will not have analog output");
      MCP_status=false;
    }
    else
    {
      Serial.println("MCP founded");
      MCP_status=true;
      //MCP.begin();
    }
  #endif

