Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0x00,0xff);//Blue
      pixels.show(); 
      //delay(3000);
  #endif

  //print pedal role assignment
  if(dap_config_st_local.payLoadPedalConfig_.pedal_type!=4)
  {
    Serial.print("Pedal Assignment: ");
    Serial.println(dap_config_st_local.payLoadPedalConfig_.pedal_type);
  }
  else
  {
    #ifdef PEDAL_HARDWARE_ASSIGNMENT
      Serial.println("Pedal Role Assignment:4, reading from CFG pins....");
    #else
      Serial.println("Pedal Role Assignment:4, Role assignment Error, Please send the config in to finish role assignment.");
    #endif
  }
  
  #ifdef PEDAL_HARDWARE_ASSIGNMENT
    pinMode(CFG1, INPUT_PULLUP);
    pinMode(CFG2, INPUT_PULLUP);
    delay(50); // give the pin time to settle
    Serial.println("Overriding Pedal Role Assignment from Hardware switch......");
    uint8_t CFG1_reading=digitalRead(CFG1);
    uint8_t CFG2_reading=digitalRead(CFG2);
    uint8_t Pedal_assignment=CFG1_reading*2+CFG2_reading*1;//00=clutch 01=brk  02=gas
    if(Pedal_assignment==3)
    {
      Serial.println("Pedal Type:3, assignment error, please adjust dip switch on control board to finish role assignment.");
    }
    else
    {
      if(Pedal_assignment!=4)
        {
          //Serial.print("Pedal Type");
          //Serial.println(Pedal_assignment);
          if(Pedal_assignment==0)
          {
            Serial.println("Overriding Pedal as Clutch.");
          }
          if(Pedal_assignment==1)
          {
            Serial.println("Overriding Pedal as Brake.");
          }
          if(Pedal_assignment==2)
          {
            Serial.println("Overriding Pedal as Throttle.");
          }
          DAP_config_st tmp;
          global_dap_config_class.getConfig(&tmp, 500);
          tmp.payLoadPedalConfig_.pedal_type = Pedal_assignment;
          dap_config_st_local.payLoadPedalConfig_.pedal_type = Pedal_assignment;
          //global_dap_config_class.setConfig(tmp);

          configDataPackage_t configPackage_st;
          configPackage_st.config_st = tmp;
          xQueueSend(configUpdateAvailableQueue, &configPackage_st, portMAX_DELAY);

        }
        else
        {
          Serial.println("Asssignment error, defective pin connection, pelase connect USB and send a config to finish assignment");
        }
    }
   
  #endif

  //enable ESP-NOW
  #ifdef ESPNOW_Enable
  dap_calculationVariables_st.rudder_brake_status=false;
  if(dap_config_st_local.payLoadPedalConfig_.pedal_type==0||dap_config_st_local.payLoadPedalConfig_.pedal_type==1||dap_config_st_local.payLoadPedalConfig_.pedal_type==2)
  {
    Serial.println("Starting ESP now tasks");
    ESPNow_initialize();
    Serial.println("ESPNOW initialized, add task in");
    // xTaskCreatePinnedToCore(
    //                     ESPNOW_SyncTask,   
    //                     "ESPNOW_update_Task", 
    //                     10000,  
    //                     //STACK_SIZE_FOR_TASK_2,    
    //                     NULL,      
    //                     1,         
    //                     &handle_espnowTask,    
    //                     CORE_ID_ESPNOW_TASK);  
                        
    addScheduledTask(ESPNOW_SyncTask, "ESPNOW_update_Task", REPETITION_INTERVAL_ESPNOW_TASK_IN_US, TASK_PRIORITY_ESPNOW_TASK, CORE_ID_ESPNOW_TASK, 10000);
    Serial.println("ESPNOW task added");
    delay(500);
  }
  else
  {
    Serial.println("ESPNOW task did not started due to Assignment error, please usb connect to Simhub and finish Assignment.");
  }
  #endif
  Serial.println("Setup Controller");
  #ifdef CONTROLLER_SPECIFIC_VIDPID
    SetupController_USB(dap_config_st_local.payLoadPedalConfig_.pedal_type);
    delay(500);
  #endif  
  #ifndef CONTROLLER_SPECIFIC_VIDPID
  // init controller
  #ifdef USB_JOYSTICK
    SetupController();
  #endif
  //delay(3000);
  #endif




  



  Serial.println("Setup end");
  #ifdef USING_LED
      //pixels.setBrightness(20);
      pixels.setPixelColor(0,0x00,0xff,0x00);//Green
      pixels.show(); 
      //delay(3000);
  #endif

  #ifdef USING_BUZZER
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==0)
    {
      delay(500);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
    }
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==1)
    {
      Buzzer.single_beep_ledc_fade(NOTE_A4,3072,1);
    }    
    if(dap_config_st_local.payLoadPedalConfig_.pedal_type==2)
    {
      delay(500);
      //Buzzer.single_beep_ledc_fade(NOTE_A4,1536,0.5);
      Buzzer.single_beep_ledc_fade(NOTE_D4,3072,1);
    }    
    //Buzzer.single_beep_tone(440,1500);
  #endif

    // stepper->pauseTask();

}




/**********************************************************************************************/
/*                                                                                            */
/*                         Calc update function                                               */
/*                                                                                            */
/**********************************************************************************************/
void updatePedalCalcParameters()
{
  DAP_config_st dap_config_st_local;  
  global_dap_config_class.getConfig(&dap_config_st_local, 500);

  dap_calculationVariables_st.updateFromConfig(dap_config_st_local);
  dap_calculationVariables_st.updateEndstops(stepper->getLimitMin(), stepper->getLimitMax());
  stepper->updatePedalMinMaxPos(dap_config_st_local.payLoadPedalConfig_.pedalStartPosition, dap_config_st_local.payLoadPedalConfig_.pedalEndPosition);
  dap_calculationVariables_st.updateStiffness();

  // tune the PID settings
  tunePidValues(dap_config_st_local);
}



/**********************************************************************************************/
/*                                                                                            */
/*                         Main function                                                      */
/*                                                                                            */
/**********************************************************************************************/

void printTaskStats() {
    // Static variables to persist between calls
    static TaskStatus_t *pxPreviousTaskArray = NULL;
    static uint32_t ulPreviousTotalRunTime = 0;
    static UBaseType_t uxPreviousArraySize = 0;

    TaskStatus_t *pxCurrentTaskArray;
    volatile UBaseType_t uxCurrentArraySize;
    uint32_t ulCurrentTotalRunTime;

    // Allocate memory for the current snapshot
    uxCurrentArraySize = uxTaskGetNumberOfTasks();
    pxCurrentTaskArray = (TaskStatus_t *)pvPortMalloc(uxCurrentArraySize * sizeof(TaskStatus_t));

    // Get the current system state
    if (pxCurrentTaskArray != NULL) {
        uxCurrentArraySize = uxTaskGetSystemState(pxCurrentTaskArray, uxCurrentArraySize, &ulCurrentTotalRunTime);

        // Check if this is the first run
        if (pxPreviousTaskArray != NULL) {
            // Calculate the time difference over the last second
            uint32_t ulTotalRunTimeDelta = ulCurrentTotalRunTime - ulPreviousTotalRunTime;

            if (ulTotalRunTimeDelta > 0) {
                Serial.println("\n--- Task CPU Usage (Last Second) ---");
                Serial.printf("%-25s %10s %15s %14s %30s\n", "Task", "Core ID", "Runtime [us]", "CPU %", "Free stack space [byte]");

                for (uint8_t coreIdx = 0; coreIdx < 2; coreIdx++)
                {

                  for (UBaseType_t i = 0; i < uxCurrentArraySize; i++) {

                      if (pxCurrentTaskArray[i].xCoreID == coreIdx)
                      {
                        // Find the matching task in the previous snapshot
                        for (UBaseType_t j = 0; j < uxPreviousArraySize; j++) {
                            if (pxCurrentTaskArray[i].xHandle == pxPreviousTaskArray[j].xHandle) {
                                uint32_t ulRunTimeDelta = pxCurrentTaskArray[i].ulRunTimeCounter - pxPreviousTaskArray[j].ulRunTimeCounter;
                                float cpuPercent = (100.0f * (float)ulRunTimeDelta) / (float)ulTotalRunTimeDelta;

