Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
                                Serial.printf("%-25s %10lu %15lu %14.2f %30lu\n",
                                  pxCurrentTaskArray[i].pcTaskName,
                                  pxCurrentTaskArray[i].xCoreID,
                                  (unsigned long)ulRunTimeDelta,
                                  cpuPercent,
                                  pxCurrentTaskArray[i].usStackHighWaterMark);
                                break;
                            }
                        }
                      }
                  }


                }

                
                Serial.println("-----------------------\n");
            }
        }

        // Free the previous snapshot and save the current one for the next cycle
        if (pxPreviousTaskArray != NULL) {
            vPortFree(pxPreviousTaskArray);
        }
        pxPreviousTaskArray = pxCurrentTaskArray;
        ulPreviousTotalRunTime = ulCurrentTotalRunTime;
        uxPreviousArraySize = uxCurrentArraySize;
    } else {
        Serial.println("Failed to allocate memory for task stats.");
    }
}

void profilerTask( void * pvParameters )
{
  for(;;){
    // copy global struct to local for faster and safe executiion
    DAP_config_st dap_config_profilerTask_st;
    global_dap_config_class.getConfig(&dap_config_profilerTask_st, 500);

    // activate profiler depending on pedal config
    if (dap_config_profilerTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_NET_RUNTIME) 
    {
      printTaskStats();
    }


    delay(5000);
    taskYIELD();
  }
}


void loop() {
  // vTaskDelete(NULL);  // Kill the Arduino loop task

  delay(5000);
  taskYIELD();
}




/**********************************************************************************************/
/*                                                                                            */
/*                         pedal update task                                                  */
/*                                                                                            */
/**********************************************************************************************/
void IRAM_ATTR_FLAG pedalUpdateTask( void * pvParameters )
{

  static DRAM_ATTR DAP_state_extended_st dap_state_extended_st_lcl_pedalUpdateTask;
  static DRAM_ATTR DAP_state_basic_st dap_state_basic_st_lcl_pedalUpdateTask;

  FunctionProfiler profiler_pedalUpdateTask;
  profiler_pedalUpdateTask.setName("PedalUpdate");
  float loadcellReading = 0.0f;
  float filteredReading_exp_filter = 0;
  unsigned long servoActionLast = millis();
  bool firstReadConfig=true;

  uint32_t controlTask_stackSizeIdx_u32 = 0;
  float previousLoadcellReadingInKg_fl32 = 0.0f;


  float effect_force;
  int32_t Position_effect;
  int32_t BP_trigger_value;
  int32_t BP_trigger_min;
  int32_t BP_trigger_max;
  int32_t Position_check;
  int32_t Rudder_real_poisiton;
  float joystickNormalizedToInt32_orig;
  float joystickfrac;
  float joystickNormalizedToInt32_eval;
  int32_t joystickNormalizedToInt32 = 0;
  int32_t ABS_trigger_value;

  uint8_t sendPedalStructsViaSerialCounter_u8 = 0;
  uint8_t sendJoystickDataCounter_u8 = 0;

  static DAP_config_st dap_config_pedalUpdateTask_st;
  global_dap_config_class.getConfig(&dap_config_pedalUpdateTask_st, 500);

  static const uint8_t joystickSendCounterMax_u8 = (REPETITION_INTERVAL_JOYSTICKOUTPUT_TASK_IN_US) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US) ;
  static const uint8_t serialSendCounterMax_u8 = (REPETITION_INTERVAL_SERIALCOMMUNICATION_TASK_IN_US) / (REPETITION_INTERVAL_PEDAL_UPDATE_TASK_IN_US) ;

  static loadcellDataPackage_t loadcellDataReceived_st;
  static configDataPackage_t configPackage_st;
  

  uint32_t cycleCount_u32 = 0;

  for(;;){


    // trigger task 
    if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {

      // if new data package is available, update the local config
      if (xQueueReceive(configUpdateSendToPedalUpdateTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
        dap_config_pedalUpdateTask_st = configPackage_st.config_st;

        // activate profiler depending on pedal config
        if (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
        {
          profiler_pedalUpdateTask.activate( true );
        }
        else
        {
          profiler_pedalUpdateTask.activate( false );
        }

        Serial.println("Update config: pedal update task");



        // update the calc params
        Serial.println("Updating the calc params");
        //Serial.print("save to eeprom tag:");
        //Serial.println(dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom);
        if(firstReadConfig)
        {
          firstReadConfig=false;
        }
        else
        {
          previewConfigGet_b = true;
          saveToEEPRomDuration = millis();
        }
        
        if (true == dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom)
        {
          dap_config_pedalUpdateTask_st.payLoadHeader_.storeToEeprom = false; // set to false, thus at restart existing EEPROM config isn't restored to EEPROM
          uint16_t crc = checksumCalculator((uint8_t*)(&(dap_config_pedalUpdateTask_st.payLoadHeader_)), sizeof(dap_config_pedalUpdateTask_st.payLoadHeader_) + sizeof(dap_config_pedalUpdateTask_st.payLoadPedalConfig_));
          dap_config_pedalUpdateTask_st.payloadFooter_.checkSum = crc;
          global_dap_config_class.setConfig(dap_config_pedalUpdateTask_st);
          Serial.println("Saving into EEPROM");
          global_dap_config_class.storeConfigToEprom();
          previewConfigGet_b = false;
          saveToEEPRomDuration = 0;
        }
        
        updatePedalCalcParameters(); // update the calc parameters
        moveSlowlyToPosition_b = true;
      
      }


      
      cycleCount_u32++;
      

      // start profiler 0, overall function
      profiler_pedalUpdateTask.start(0);
      
      

      // system identification mode
      #ifdef ALLOW_SYSTEM_IDENTIFICATION
        if (systemIdentificationMode_b == true)
        {
          measureStepResponse(stepper, &dap_calculationVariables_st, &dap_config_pedalUpdateTask_st, loadcell);
          systemIdentificationMode_b = false;
        }
      #endif
    

      
      //#define RECALIBRATE_POSITION
      #ifdef RECALIBRATE_POSITION
        stepper->checkLimitsAndResetIfNecessary();
      #endif


      // start profiler 1, effects
      profiler_pedalUpdateTask.start(1);


      // compute pedal oscillation, when ABS is active
      float absForceOffset = 0.0f;
      float absPosOffset = 0.0f;
      dap_calculationVariables_st.Default_pos();
      #ifdef ABS_OSCILLATION
        absOscillation.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absPattern, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.absForceOrTarvelBit, &absForceOffset, &absPosOffset);
        _RPMOscillation.trigger();
        _RPMOscillation.forceOffset(&dap_calculationVariables_st);
        _BitePointOscillation.forceOffset(&dap_calculationVariables_st);
        _G_force_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_multi);
        _WSOscillation.forceOffset(&dap_calculationVariables_st);
        _Road_impact_effect.forceOffset(&dap_calculationVariables_st, dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_multi);
        CV1.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_1,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_1);
        CV2.forceOffset(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_freq_2,dap_config_pedalUpdateTask_st.payLoadPedalConfig_.CV_amp_2);
        if(dap_calculationVariables_st.Rudder_status) 
        {
          _rudder.offset_calculate(&dap_calculationVariables_st);
          dap_calculationVariables_st.update_stepperMinpos(_rudder.offset_filter);
          _rudder_g_force.offset_calculate(&dap_calculationVariables_st);
          dap_calculationVariables_st.update_stepperMaxpos(_rudder_g_force.offset_filter);
        }
        if(dap_calculationVariables_st.helicopterRudderStatus) 
        {
          helicopterRudder_.offset_calculate(&dap_calculationVariables_st);
          dap_calculationVariables_st.update_stepperMinpos(helicopterRudder_.offset_filter);
        }
        #ifdef ESPNow_debug_rudder
          if(millis()-debugMessageLast>500)
          {
            debugMessageLast=millis();
            Serial.print("Center offset:");
            Serial.println(_rudder.offset_filter);
            Serial.print("min default:");
            Serial.println(dap_calculationVariables_st.stepperPosMin_default);
          }
        #endif

        //_rudder.force_offset_calculate(&dap_calculationVariables_st);

      #endif

      //update max force with G force effect
      movingAverageFilter.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.G_window;
      movingAverageFilter_roadimpact.dataPointsCount = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.Road_window;
      dap_calculationVariables_st.reset_maxforce();
      dap_calculationVariables_st.Force_Max += _G_force_effect.G_force;
      dap_calculationVariables_st.Force_Max += _Road_impact_effect.Road_Impact_force;
      dap_calculationVariables_st.dynamic_update();
      dap_calculationVariables_st.updateStiffness();
    
      // end profiler 1, effects
      profiler_pedalUpdateTask.end(1);

