Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
      // end profiler 4, movement strategy
      profiler_pedalUpdateTask.end(5);

      // start profiler 6, ...
      profiler_pedalUpdateTask.start(6);

      // add dampening
      if (dap_calculationVariables_st.dampingPress  > 0.0001f)
      {
        // dampening is proportional to velocity --> D-gain for stability
        Position_Next -= dap_calculationVariables_st.dampingPress * changeVelocity * dap_calculationVariables_st.springStiffnesssInv;
      }
        
      // clip target position to configured target interval with RPM effect movement in the endstop
      Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMin, dap_calculationVariables_st.stepperPosMax);
      
    
      // Adding effects
      //Add effect by force
      effect_force = _BitePointOscillation.BitePoint_Force_offset + _WSOscillation.WS_Force_offset + CV1.CV_Force_offset + CV2.CV_Force_offset;

      if(filteredReading>=dap_calculationVariables_st.Force_Min)
      {
        Position_Next -= absPosOffset;
        effect_force += absForceOffset;
      }
      Position_effect= effect_force/dap_calculationVariables_st.Force_Range*dap_calculationVariables_st.stepperPosRange;
      Position_Next -=_RPMOscillation.RPM_position_offset;

      Position_Next -= Position_effect;
      Position_Next = (int32_t)constrain(Position_Next, dap_calculationVariables_st.stepperPosMinEndstop, dap_calculationVariables_st.stepperPosMaxEndstop);
      
      //bitepoint trigger
      BP_trigger_value = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger_value;
      BP_trigger_min = (BP_trigger_value-4);
      BP_trigger_max = (BP_trigger_value+4);
      Position_check = 100*((Position_Next-dap_calculationVariables_st.stepperPosMin) / dap_calculationVariables_st.stepperPosRange);
      Rudder_real_poisiton= 100*((Position_Next-dap_calculationVariables_st.stepperPosMin_default) / dap_calculationVariables_st.stepperPosRange_default);

      dap_calculationVariables_st.current_pedal_position = Position_Next;
      dap_calculationVariables_st.current_pedal_position_ratio=((float)(dap_calculationVariables_st.current_pedal_position-dap_calculationVariables_st.stepperPosMin_default))/((float)dap_calculationVariables_st.stepperPosRange_default);
      //Rudder initialzing and de initializing
      #ifdef ESPNOW_Enable
        if(dap_calculationVariables_st.Rudder_status)
        {
          if(Rudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //Serial.println("moving to center");
          }
          if(Rudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //Serial.print("Rudder initializing...");
              //Serial.println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                Rudder_initializing=false;
                moveSlowlyToPosition_b=false;
                Serial.println("Rudder initialized");
                dap_calculationVariables_st.isRudderInitialized=true;
                Rudder_initialized_time=0;
                #ifdef USING_BUZZER
                  Buzzer.play_melody_tone(melody_Airship_theme, sizeof(melody_Airship_theme)/sizeof(melody_Airship_theme[0]),melody_Airship_theme_duration);
                #endif
              }
            }
            

          }
        }
        if(Rudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
          //Serial.println("moving to min end stop");
        }
        if(Rudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          Rudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          Serial.println("Rudder deinitialized");
          dap_calculationVariables_st.isRudderInitialized=false;
        }
        //helicopter rudder initialzied
        if(dap_calculationVariables_st.helicopterRudderStatus)
        {
          if(HeliRudder_initializing)
          {
            moveSlowlyToPosition_b=true;
            //Serial.println("moving to center");
          }
          if(HeliRudder_initializing && (Rudder_real_poisiton<52 && Rudder_real_poisiton>48))
          {
            if(Rudder_initialized_time==0)
            {
              Rudder_initialized_time=millis();
            }
            else
            {
              unsigned long Rudder_initialzing_time_Now = millis();
              //wait 3s for the initializing
              //Serial.print("Rudder initializing...");
              //Serial.println(Rudder_initialzing_time_Now-Rudder_initialized_time);
              if( (Rudder_initialzing_time_Now-Rudder_initialized_time)> Rudder_timeout )
              {
                HeliRudder_initializing=false;
                moveSlowlyToPosition_b=false;
                Serial.println("HeliRudder initialized");
                dap_calculationVariables_st.isHelicopterRudderInitialized=true;
                Rudder_initialized_time=0;
                #ifdef USING_BUZZER
                  Buzzer.play_melody_tone(melodyAirwolfTheme, sizeof(melodyAirwolfTheme)/sizeof(melodyAirwolfTheme[0]),melodyAirwolfThemeDuration);
                #endif
              }
            }
          }
        }
        if(HeliRudder_deinitializing)
        {
          moveSlowlyToPosition_b=true;
            //Serial.println("moving to min end stop");
        }
        if(HeliRudder_deinitializing && (Rudder_real_poisiton< 2 ))
        {
          HeliRudder_deinitializing=false;
          moveSlowlyToPosition_b=false;
          Serial.println("HeliRudder deinitialized");
          dap_calculationVariables_st.isHelicopterRudderInitialized=false;
        }
      #endif

      //Serial.println(Position_check);
      if(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.BP_trigger==1)
      {
        if(Position_check > BP_trigger_min)
        {
          if(Position_check < BP_trigger_max)
          {
            _BitePointOscillation.trigger();
          }
        }
      }

      // if pedal in min position, recalibrate position --> automatic step loss compensation
      stepper->configSteplossRecovAndCrashDetection(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.stepLossFunctionFlags_u8);
      if (stepper->isAtMinPos())
      {
        #if defined(OTA_update_ESP32) || defined(OTA_update)
          if(OTA_status==false)
          {
            stepper->correctPos();
          }
        #else
          stepper->correctPos();
        #endif
      }

      // set position command smoothing
      stepper->configSetPositionCommandSmoothingFactor(dap_config_pedalUpdateTask_st.payLoadPedalConfig_.positionSmoothingFactor_u8);
      stepper->configSetProfilingFlag( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) );

      // reset all servo alarms
      if ( (dap_config_pedalUpdateTask_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS) )
      {
        Serial.println("Set clear alarm history flag");
        stepper->clearAllServoAlarms();
        delay(1000); // makes sure the routine has finished

        DAP_config_st tmp;
        global_dap_config_class.getConfig(&tmp, 500);
        tmp.payLoadPedalConfig_.debug_flags_0 &= ( ~(uint8_t)DEBUG_INFO_0_RESET_ALL_SERVO_ALARMS); // clear the debug bit
        //global_dap_config_class.setConfig(tmp);

