Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
        }

        if (sendExtendedFlag_b)
        {
          // update extended pedal structures
          dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0; // 170
          dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1; // 85

          dap_state_extended_st_lcl_pedalUpdateTask.payloadFooter_.enfOfFrame0_u8 =  EOF_BYTE_0; // 170
          dap_state_extended_st_lcl_pedalUpdateTask.payloadFooter_.enfOfFrame1_u8 =  EOF_BYTE_1; // 86

          // update extended struct 
          //dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.timeInMs_u32 = millis();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.timeInUs_u32 = micros();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.cycleCount_u32 = cycleCount_u32;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.pedalForce_raw_fl32 =  loadcellReading;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.pedalForce_filtered_fl32 =  filteredReading;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.forceVel_est_fl32 =  changeVelocity;

          //dap_state_extended_st.payloadPedalState_Extended_.servoPosition_i16 = stepper->getServosInternalPosition();
          int32_t minPos = 0; //stepper->getMinPosition();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.servoPosition_i16 = stepper->getServosInternalPositionCorrected() - minPos;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.servo_voltage_0p1V =  stepper->getServosVoltage();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.servo_current_percent_i16 = stepper->getServosCurrent();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.servo_position_error_i16 = stepper->getServosPosError();
          
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.servoPositionEstimated_i16 = stepper->getEstimatedPosError();

          
          //dap_state_extended_st.payloadPedalState_Extended_.servoPositionTarget_i16 = stepper->getCurrentPositionFromMin();
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.servoPositionTarget_i16 = stepper->getCurrentPosition() - minPos;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.angleSensorOutput_ui16 = angleReading_ui16;
          dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_.brakeResistorState_b = stepper->getBrakeResistorState();
          dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_.PedalTag = dap_config_pedalUpdateTask_st.payLoadPedalConfig_.pedal_type;
          dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_.payloadType = DAP_PAYLOAD_TYPE_STATE_EXTENDED;
          dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_.version = DAP_VERSION_CONFIG;
          //dap_state_extended_st_lcl_pedalUpdateTask.payloadFooter_.checkSum = checksumCalculator((uint8_t*)(&(dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_)), sizeof(dap_state_extended_st_lcl_pedalUpdateTask.payLoadHeader_) + sizeof(dap_state_extended_st_lcl_pedalUpdateTask.payloadPedalState_Extended_));

        }



        if (sendPedalStructsViaSerialCounter_u8 == 0)
        {
          // Package the new state data into a single struct
          PedalStatePackage_t newStatePackage;
          newStatePackage.basic_st = dap_state_basic_st_lcl_pedalUpdateTask;
          newStatePackage.extended_st = dap_state_extended_st_lcl_pedalUpdateTask;
          newStatePackage.sendBasicFlag_b = sendBasicFlag_b;
          newStatePackage.sendExtendedFlag_b = sendExtendedFlag_b;

          // Send the package to the queue. Use a timeout of 0 (non-blocking).
          // If the queue is full, the data is simply dropped. This prevents this
          // high-priority control task from ever blocking on a full serial buffer.
          xQueueSend(pedalStateQueue, &newStatePackage, (TickType_t)0);
        }
      }

      // start profiler 8, struct exchange
      profiler_pedalUpdateTask.end(7);

      

      



      profiler_pedalUpdateTask.end(0);

      // print profiler results
      // profiler_pedalUpdateTask.report();
    
    }

    // taskYIELD();
  }
}

  






/**********************************************************************************************/
/*                                                                                            */
/*                         joystick output task                                               */
/*                                                                                            */
/**********************************************************************************************/

#ifdef USB_JOYSTICK
void IRAM_ATTR_FLAG joystickOutputTask( void * pvParameters )
{ 

  // FunctionProfiler profiler_joystickOutputTask;
  // profiler_joystickOutputTask.setName("JoystickOutput");
  // profiler_joystickOutputTask.setNumberOfCalls(500);
  // configDataPackage_t configPackage_st;
  // static DAP_config_st jut_dap_config_st;
  

  // This task now waits for a complete package of data from the queue.
  joystickDataPackage_t receivedJoystickData;

  
  for(;;){

    // if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {
    if (xQueueReceive(joystickDataQueue, &receivedJoystickData, portMAX_DELAY) == pdPASS) {


      // start profiler 0, overall function
      // profiler_joystickOutputTask.start(0);
      // // if new data package is available, update the local config
      // if (xQueueReceive(configUpdateSendToJoystickTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
      //   jut_dap_config_st = configPackage_st.config_st;
      //   // activate profiler depending on pedal config
      //   if (jut_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
      //   {
      //     profiler_joystickOutputTask.activate( true );
      //   }
      //   else
      //   {
      //     profiler_joystickOutputTask.activate( false );
      //   }

      //   Serial.println("Update config: joystick task");
      // } 


      
      // profiler_joystickOutputTask.start(1);

      int32_t joystickData_i32 = receivedJoystickData.joystickNormalizedToInt32;
      bool sendFlag_b = receivedJoystickData.sendJoystickFlag_b;

      if (sendFlag_b)
      {

        // send joystick output
        
          if (IsControllerReady()) 
          {
            if(dap_calculationVariables_st.Rudder_status==false)
            {
              //general output
              SetControllerOutputValue(joystickData_i32);
              
              // Restart HID output if faulty behavior was detected
              JoystickSendState();
              if(!GetJoystickStatus())
              {
                RestartJoystick();
                Serial.println("HID Error, Restart Joystick...");
                //last_serial_joy_out=millis();
              }

