Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
            }
          }
        
      }

      // profiler_joystickOutputTask.end(1);
      // profiler_joystickOutputTask.end(0);

      // // print profiler results
      // profiler_joystickOutputTask.report();

    }
  }
}
#endif
/**********************************************************************************************/
/*                                                                                            */
/*                         communication task                                                 */
/*                                                                                            */
/**********************************************************************************************/

typedef struct {
    uint16_t startBytePos_u16;
    uint16_t endBytePos_u16;
    uint16_t payloadType_u16;
    bool validFlag_b;
} structChecker_st;

// Helper function to determine expected packet size from payload type
// Returns 0 if the payload type is unknown.
static inline size_t getExpectedPacketSize(uint8_t payloadType) {
    switch (payloadType) {
        case DAP_PAYLOAD_TYPE_CONFIG:
            return sizeof(DAP_config_st);
        case DAP_PAYLOAD_TYPE_ACTION:
            return sizeof(DAP_actions_st);
        case DAP_PAYLOAD_TYPE_ACTION_OTA:
            return sizeof(DAP_action_ota_st);
        // Add other packet types here in the future
        default:
            return 0;
    }
}

// NOTE: The IRAM_ATTR attribute has been removed as it is not needed for a FreeRTOS task function.
void serialCommunicationTaskRx(void *pvParameters) {
    FunctionProfiler profiler_serialCommunicationTask;
    profiler_serialCommunicationTask.setName("SerialCommunicationRx");
    profiler_serialCommunicationTask.setNumberOfCalls(500);

    static DAP_config_st sct_dap_config_st;

    // Buffer to accumulate incoming serial data
    const size_t RX_BUFFER_SIZE = 1028; // Should be at least 2x the largest possible packet
    static uint8_t rx_buffer[RX_BUFFER_SIZE];
    static size_t buffer_len = 0;

    configDataPackage_t configPackage_st;

    for (;;) {
        // Wait for a notification that data might be available
        if (ulTaskNotifyTake(pdTRUE, portMAX_DELAY) > 0) {


          // if new data package is available, update the local config
          if (xQueueReceive(configUpdateSendToSerialRXTaskQueue, &configPackage_st, (TickType_t)0) == pdPASS) {
            sct_dap_config_st = configPackage_st.config_st;

            // activate profiler depending on pedal config
            if (sct_dap_config_st.payLoadPedalConfig_.debug_flags_0 & DEBUG_INFO_0_CYCLE_TIMER) 
            {
              profiler_serialCommunicationTask.activate( true );
            }
            else
            {
              profiler_serialCommunicationTask.activate( false );
            }

            Serial.println("Update config: serial RX");
          } 

          

          // Activate profiler based on config
          profiler_serialCommunicationTask.start(0);

          // --- 1. Read all available data into our buffer ---
          if (Serial.available()) {
              // Prevent buffer overflow by only reading what fits
              size_t bytesToRead = min((size_t)Serial.available(), RX_BUFFER_SIZE - buffer_len);
              if (bytesToRead > 0) {
                  Serial.readBytes(&rx_buffer[buffer_len], bytesToRead);
                  buffer_len += bytesToRead;
              }

              // Serial.println("Serial data available");
          }

          // --- 2. Process all complete packets in the buffer ---
          size_t buffer_idx = 0;
          while (buffer_idx < buffer_len) {
              // A. Find the next valid Start-of-Frame (SOF)
              if (rx_buffer[buffer_idx] != SOF_BYTE_0 || (buffer_idx + 1 < buffer_len && rx_buffer[buffer_idx + 1] != SOF_BYTE_1)) {
                  buffer_idx++;
                  continue; // Keep scanning for a SOF
              }

              // Serial.println("1st check passed");

              // SOF found at buffer_idx. Check if we have enough data for a header.
              if (buffer_len < buffer_idx + 3) {
                  // Not enough data for a full header, stop parsing for now
                  break;
              }

              // B. Get expected packet size from payload type
              uint8_t payloadType = rx_buffer[buffer_idx + 2];
              size_t expectedSize = getExpectedPacketSize(payloadType);

              if (expectedSize == 0) {
                  // Unknown payload type, this SOF is corrupt. Skip it and continue scanning.
                  buffer_idx++;
                  continue;
              }

              // Serial.println("2nd check passed");

              // C. Check if the full packet has arrived
              if (buffer_len < buffer_idx + expectedSize) {
                  // Full packet is not yet in the buffer, wait for more data
                  break;
              }

              // D. Check for valid End-of-Frame (EOF)
              if (rx_buffer[buffer_idx + expectedSize - 2] != EOF_BYTE_0 || rx_buffer[buffer_idx + expectedSize - 1] != EOF_BYTE_1) {
                  // EOF is wrong, this packet is corrupt. Skip the SOF and continue scanning.
                  buffer_idx++;
                  continue;
              }
              
              // --- We have a candidate packet! Now validate and process it. ---
              uint8_t* packet_start = &rx_buffer[buffer_idx];
              bool structIsValid = true;
              uint16_t received_crc = 0;
              uint16_t calculated_crc = 0;

              switch (payloadType) {
                  case DAP_PAYLOAD_TYPE_CONFIG: {
                      DAP_config_st received_config;
                      memcpy(&received_config, packet_start, sizeof(DAP_config_st));
                      
                      calculated_crc = checksumCalculator((uint8_t*)(&(received_config.payLoadHeader_)), sizeof(received_config.payLoadHeader_) + sizeof(received_config.payLoadPedalConfig_));
                      received_crc = received_config.payloadFooter_.checkSum;

                      if (calculated_crc != received_crc || received_config.payLoadHeader_.version != DAP_VERSION_CONFIG) {
                          structIsValid = false;
                      } else {
                          // --- VALID CONFIG PACKET ---
                        Serial.println("Updating pedal config from serial");
                        //global_dap_config_class.setConfig(received_config);

