Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
                          }
                          
                          // trigger system identification
                          if (received_action.payloadPedalAction_.startSystemIdentification_u8)
                          {
                            systemIdentificationMode_b = true;
                          }
                          // trigger Custom effect effect 1
                          if (received_action.payloadPedalAction_.Trigger_CV_1)
                          {
                            CV1.trigger();
                          }
                          // trigger Custom effect effect 2
                          if (received_action.payloadPedalAction_.Trigger_CV_2)
                          {
                            CV2.trigger();
                          }
                          // trigger return pedal position
                          if (received_action.payloadPedalAction_.returnPedalConfig_u8)
                          {
                          
                            DAP_config_st * dap_config_st_local_ptr;
                            dap_config_st_local_ptr = &sct_dap_config_st;
                            dap_config_st_local_ptr->payLoadHeader_.startOfFrame0_u8 = SOF_BYTE_0;
                            dap_config_st_local_ptr->payLoadHeader_.startOfFrame1_u8 = SOF_BYTE_1;
                            dap_config_st_local_ptr->payloadFooter_.enfOfFrame0_u8 = EOF_BYTE_0;
                            dap_config_st_local_ptr->payloadFooter_.enfOfFrame1_u8 = EOF_BYTE_1;
                            uint16_t crc = checksumCalculator((uint8_t*)(&(sct_dap_config_st.payLoadHeader_)), sizeof(sct_dap_config_st.payLoadHeader_) + sizeof(sct_dap_config_st.payLoadPedalConfig_));
                            dap_config_st_local_ptr->payloadFooter_.checkSum = crc;

                            // suspend the serial Tx task so that data can properly be send
                            vTaskSuspend(handle_serialCommunicationTx);
                            delay(50);
                            Serial.write((char*)dap_config_st_local_ptr, sizeof(DAP_config_st));
                            Serial.print("Return pedal config");
                            delay(50);
                            vTaskResume(handle_serialCommunicationTx);

                          }
                          #ifdef ESPNOW_Enable
                            if(received_action.payloadPedalAction_.Rudder_action==1)//Enable Rudder
                            {
                              if(dap_calculationVariables_st.Rudder_status==false)
                              {
                                dap_calculationVariables_st.Rudder_status=true;
                                Serial.println("Rudder on");
                                Rudder_initializing=true;
                                moveSlowlyToPosition_b=true;
                                //Serial.print("status:");
                                //Serial.println(dap_calculationVariables_st.Rudder_status);
                              }
                              else
                              {
                                dap_calculationVariables_st.Rudder_status=false;
                                Serial.println("Rudder off");
                                Rudder_deinitializing=true;
                                moveSlowlyToPosition_b=true; 

                                //Serial.print("status:");
                                //Serial.println(dap_calculationVariables_st.Rudder_status);
                              }
                            }
                            if(received_action.payloadPedalAction_.Rudder_brake_action==1)
                            {
                              if(dap_calculationVariables_st.rudder_brake_status==false&&dap_calculationVariables_st.Rudder_status==true)
                              {
                                dap_calculationVariables_st.rudder_brake_status=true;
                                Serial.println("Rudder brake on");
                                //Serial.print("status:");
                                //Serial.println(dap_calculationVariables_st.Rudder_status);
                              }
                              else
                              {
                                dap_calculationVariables_st.rudder_brake_status=false;
                                Serial.println("Rudder brake off");
                                //Serial.print("status:");
                                //Serial.println(dap_calculationVariables_st.Rudder_status);
                              }
                            }
                            //clear rudder status
                            if(received_action.payloadPedalAction_.Rudder_action==2)
                            {
                              dap_calculationVariables_st.Rudder_status=false;
                              dap_calculationVariables_st.rudder_brake_status=false;
                              Serial.println("Rudder Status Clear");
                              Rudder_deinitializing=true;
                              moveSlowlyToPosition_b=true;

                            }
                          #endif
                          
                          

                          
                      }
                      break;
                  }
                  case DAP_PAYLOAD_TYPE_ACTION_OTA:{
                    memcpy(&dap_action_ota_st, packet_start, sizeof(DAP_action_ota_st));
                    Serial.println("Get OTA command");
                    #ifdef USING_BUZZER
                      buzzerBeepAction_b=true;
                    #endif

                    //Serial.readBytes((char*)&dap_action_ota_st, sizeof(DAP_action_ota_st));
                    #ifdef OTA_update
                      if(dap_action_ota_st.payLoadHeader_.payloadType==DAP_PAYLOAD_TYPE_ACTION_OTA)
                      {
                        if(dap_action_ota_st.payloadOtaInfo_.device_ID == sct_dap_config_st.payLoadPedalConfig_.pedal_type)
                        {
                          SSID=new char[dap_action_ota_st.payloadOtaInfo_.SSID_Length+1];
                          PASS=new char[dap_action_ota_st.payloadOtaInfo_.PASS_Length+1];
                          memcpy(SSID,dap_action_ota_st.payloadOtaInfo_.WIFI_SSID,dap_action_ota_st.payloadOtaInfo_.SSID_Length);
                          memcpy(PASS,dap_action_ota_st.payloadOtaInfo_.WIFI_PASS,dap_action_ota_st.payloadOtaInfo_.PASS_Length);
                          SSID[dap_action_ota_st.payloadOtaInfo_.SSID_Length]=0;
                          PASS[dap_action_ota_st.payloadOtaInfo_.PASS_Length]=0;
                          OTA_enable_b=true;
                          OTA_enable_start=true;
                          #ifdef ESPNOW_Enable
                            ESPNow_OTA_enable=false;
                          #endif
                        }
                      }
                    #else
                      Serial.println("The command is not supported");
                    #endif    
                    break;
                }

                  
              } // end switch

              if (!structIsValid) {
                  Serial.printf("Invalid packet detected (Type: %d). Skipping SOF.\n", payloadType);
                  buffer_idx++; // Skip the failed SOF and continue scanning
              } else {
                  // Packet was valid and processed, advance index past this packet
                  buffer_idx += expectedSize;
              }
          } // end while

          // --- 3. Clean up the buffer ---
          if (buffer_idx > 0) {
              size_t remaining_len = buffer_len - buffer_idx;
              if (remaining_len > 0) {
                  memmove(rx_buffer, &rx_buffer[buffer_idx], remaining_len);
              }
              buffer_len = remaining_len;
          }

          profiler_serialCommunicationTask.end(0);
          profiler_serialCommunicationTask.report();
        } // end if TaskNotifyTake
    } // end for(;;)
}



uint32_t communicationTask_stackSizeIdx_u32 = 0;
void IRAM_ATTR_FLAG serialCommunicationTaskTx( void * pvParameters )
{ 
  // FunctionProfiler profiler_serialCommunicationTask;
  // profiler_serialCommunicationTask.setName("SerialCommunicationTx");
  // profiler_serialCommunicationTask.setNumberOfCalls(500);

  // static DAP_config_st sct_dap_config_st;

