Xanglu/DIY-Sim-Racing-FFB-Pedal-Odrive/ESP32/src/Main.cpp
          } 
              
                  
        #endif



      }

      profiler_espNow.end(0);

      // print profiler results
      profiler_espNow.report();

      // force a context switch
		taskYIELD();
    }
}
#endif

#define CONFIG_PREVIEW_DURATION 180000// wait 3 mins then save config into eeprom
void miscTask( void * pvParameters )
{
  static DAP_config_st misc_dap_config_st;
  // for the task no need complete asap, ex buzzer, led 
  for(;;)
  {
    global_dap_config_class.getConfig(&misc_dap_config_st, 500);
    if(previewConfigGet_b && ((millis()-saveToEEPRomDuration)>CONFIG_PREVIEW_DURATION))
    {
      
      Serial.println("Auto save config in pedal");
      /*
      Serial.print(millis());
      Serial.print(" Duration:");
      Serial.print(saveToEEPRomDuration);
      Serial.print(" flag:");
      Serial.println(previewConfigGet_b);
      */
      //saveToEEPRomDuration=0;
      global_dap_config_class.storeConfigToEprom();
      previewConfigGet_b=false;
      #ifdef USING_BUZZER
        Buzzer.single_beep_tone(700,50);
        delay(50);
        Buzzer.single_beep_tone(700,50);
      #endif 
    }
    #ifdef USING_BUZZER
      //make buzzer sound actions here
      #ifdef ESPNOW_Enable
        if(Config_update_Buzzer_b)
        {
          Buzzer.single_beep_tone(700,50);
          Config_update_Buzzer_b=false;
        }
      #endif
      if(buzzerBeepAction_b)
      {
        Buzzer.single_beep_tone(700,50);
        buzzerBeepAction_b=false;
      }
    #endif
    #if defined(OTA_update) && defined(USING_BUZZER)
      if(beepForOtaProgress)
      {
        Buzzer.single_beep_tone(700,50);
        beepForOtaProgress=false;
      }
    #endif
    delay(50);
  }
}
